#! /usr/local/bin/python

# Python 3.5.1

#-------------------------------------
# import
#-------------------------------------
import sys
import os

# pygame系
import pygame
# pygameの定数はpygame.localsに入っている
from pygame.locals import QUIT


#-------------------------------------
# 定数
#-------------------------------------
# FPSクロック（1秒間に何回処理するか）
FPS_TIMES = 30


#-------------------------------------
# 初期処理
#-------------------------------------
# pygame初期化
pygame.init()

# ウィンドウ
w = pygame.display.set_mode((400, 300))

# ウィンドウのタイトル（タイトルバーに表示）
pygame.display.set_caption("My First Window")

# クロックオブジェクト
fpsclock = pygame.time.Clock()


#-------------------------------------
# Windowの中で画像が回転する（中心基準）
#-------------------------------------
def main():
    
    logo = pygame.image.load(os.path.join("..", "_images", "pythonlog.jpg"))
    
    # 画像の回転度数
    theta = 0
    
    #-------------------------------------
    # メインループ
    #-------------------------------------
    while True:
        for event in pygame.event.get(QUIT):
            # イベントキューからイベントを取得
            # 閉じるボタンが押されたイベント発生
            pygame.quit()
            sys.exit()
        
        
        # 画像の回転度数
        theta += 1
        
        #-------------------------------------
        # 画面塗り潰し（真っ白）
        #-------------------------------------
        w.fill((255,255,255))
        
        
        #-------------------------------------
        # ～処理～↓
        #-------------------------------------
        new_logo = pygame.transform.rotate(logo,theta)
        # ↓左上基準と違うところ
        rect = new_logo.get_rect()
        rect.center = (200,150)
        # ↑左上基準と違うところ
        w.blit(new_logo,rect)
        #-------------------------------------
        # ～処理～↑
        #-------------------------------------
        
        
        #-------------------------------------
        # 画面更新
        #-------------------------------------
        pygame.display.update()
        
        #-------------------------------------
        # FPS CLOCK
        #-------------------------------------
        fpsclock.tick(FPS_TIMES)
        


#-------------------------------------
# メイン時のみmain()関数コール
#-------------------------------------
if __name__ == '__main__':
    main()
