#! /usr/local/bin/python

# Python 3.5.1

#-------------------------------------
# import
#-------------------------------------
import sys

# pygame系
import pygame
# pygameの定数はpygame.localsに入っている
from pygame.locals import QUIT, Rect


#-------------------------------------
# 定数
#-------------------------------------
# FPSクロック（1秒間に何回処理するか）
FPS_TIMES = 30


#-------------------------------------
# 初期処理
#-------------------------------------
# pygame初期化
pygame.init()

# ウィンドウ
w = pygame.display.set_mode((400, 300))

# ウィンドウのタイトル（タイトルバーに表示）
pygame.display.set_caption("My First Window")

# クロックオブジェクト
fpsclock = pygame.time.Clock()


#-------------------------------------
# 四角を描画するだけ
#-------------------------------------
def main():
    
    #-------------------------------------
    # メインループ
    #-------------------------------------
    while True:
        for event in pygame.event.get():
            # イベントキューからイベントを取得
            # 閉じるボタンが押されたイベント発生
            if event.type == QUIT:
                pygame.quit()
                sys.exit()
        
        #-------------------------------------
        # 画面塗り潰し（真っ白）
        #-------------------------------------
        w.fill((255,255,255))
                
        
        #-------------------------------------
        # ～処理～↓
        #-------------------------------------
        # 赤：矩形（塗り潰し）
        pygame.draw.rect(w, (255,0,0), (10,20,100,50))
        
        # 赤：矩形（塗り潰さない、太さ3）
        pygame.draw.rect(w, (255,0,0), (150,10,100,30), 3)
        
        # 緑：矩形（塗り潰し）
        pygame.draw.rect(w, (0,255,0), ((100,80),(80,50)))

        # 青：矩形（塗り潰し、Rectオブジェクト）
        rect0 = Rect(200, 60, 140, 80)
        pygame.draw.rect(w, (0,0,255), rect0)
        
        # 黄：矩形（塗り潰し、Rectオブジェクト）
        rect1 = Rect((30,160), (100,50))
        pygame.draw.rect(w, (255,255,0), rect1)
        #-------------------------------------
        # ～処理～↑
        #-------------------------------------
        
        
        #-------------------------------------
        # 画面更新
        #-------------------------------------
        pygame.display.update()
        
        #-------------------------------------
        # FPS CLOCK
        #-------------------------------------
        fpsclock.tick(FPS_TIMES)
        
        

#-------------------------------------
# メイン時のみmain()関数コール
#-------------------------------------
if __name__ == '__main__':
    main()
